drop table if exists product_types, products;

create table product_types (
	id serial primary key,
	name varchar(200) not null
);

create table products (
	id serial primary key,
	type_id int references product_types(id),
	name varchar(2000) not null,
	expired_date date,
	price numeric(12,2)
);

insert into product_types(id, name) values 
	(1, 'СЫР'),
	(2, 'МОЛОКО'),
	(3, 'КОЛБАСА'),
	(4, 'МОРОЖЕНОЕ'),
	(5, 'МЯСО'),
	(6, 'ХЛЕБОБУЛОЧНЫЕ ИЗДЕЛИЯ');

insert into products (type_id, name, expired_date, price) values 
	(1, 'Сыр Российский', '2020-06-15', '350.00'),
	(1, 'Брынза', '2020-07-01', '500.00'),
	(1, 'Сулугуни', '2020-09-01', '600.00'),
	(1, 'Сыр домашний', '2020-06-01', '1000.00'),
	(1, 'Сырный продукт', '2021-01-01', '200.00'),
	(2, 'Молоко "Красная цена"', '2020-06-01', '45.00'),
	(2, 'Кубанская буренка', '2020-06-01', '60.00'),
	(2, 'Веселый молочник 2%', '2020-06-01', '65.00'),
	(2, 'Веселый молочник 4%', '2020-06-01', '75.00'),
	(3, 'Колбаса ливерная', '2020-06-10', '200.00'),
	(3, 'Колбаса Краковская 1 сорт', '2020-06-15', '280.00'),
	(3, 'Колбаса Краковская высш.сорт', '2020-06-10', '350.00'),
	(3, 'Сервелат высш. сорт', '2020-08-10', '800.00'),
	(4, 'Эксимо', '2020-06-01', '60.00'),
	(4, 'Сливочное', '2020-06-01', '20.00'),
	(4, 'Пломбир', '2020-06-01', '40.00'),
	(4, 'Ягодное', '2020-08-01', '30.00'),
	(4, 'Московское', '2020-06-10', '55.00'),
	(5, 'Мясо свежее (говядина)', '2020-06-01', '400.00'),
	(5, 'Мясо свежее (свинина)', '2020-06-01', '370.00'),
	(5, 'Мясо замороженное (говядина)', '2020-07-01', '340.00'),
	(5, 'Мясо замороженное (свинина)', '2020-07-01', '330.00'),
	(6, 'Хлеб белый 1-й сорт', '2020-06-01', '22.00'),
	(6, 'Хлеб ароматный', '2020-07-01', '27.00'),
	(6, 'Хлеб бородинский', '2020-06-01', '24.00'),
	(6, 'Хлеб тостерный белый', '2020-06-01', '30.00'),
	(6, 'Батон нарезной', '2020-06-01', '30.00'),
	(6, 'Булочка с маком', '2020-06-01', '15.00'),
	(6, 'Сочник с творогом', '2020-06-01', '21.00');









	
	